{"title": "Beyond Tesla: Morningstar strategist names 2 under-the-radar stocks to play the EV revolution - CNBC", "description": "Beyond Tesla: Morningstar strategist names 2 under-the-radar stocks to play the EV revolution  CNBC", "published date": "Tue, 13 Feb 2024 23:18:16 GMT", "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDIvMTQvbW9ybmluZ3N0YXJzLXRvcC1zdHJhdGVnaXN0LW5hbWVzLTItc3RvY2tzLXRvLXBsYXktdGhlLWV2LXJldm9sdXRpb24uaHRtbNIBAA?oc=5&hl=en-GB&gl=GB&ceid=GB:en", "publisher": {"href": "https://www.cnbc.com", "title": "CNBC"}, "content": "The electric vehicle industry is seeing cutthroat competition between investor favorite Tesla and several Chinese automakers like BYD . However, one strategist has his sights on the wider electric vehicle ecosystem — especially automotive parts suppliers. “While Tesla grabs all the headlines, we don’t necessarily think that it’s going to be the electric vehicle manufacturers that do the best. But we also see a lot of upside for the parts suppliers,” Morningstar’s Chief Markets Strategist David Sekera said, naming BorgWarner as a company he likes. Noting that it has “the best product portfolio for electric vehicles,” he said that the stock, which has been given a five-star rating, trades at about half of Morningstar’s fair value metric right now. Morningstar gives stocks a rating of between one and five stars, with a top rating indicating that the shares are undervalued. BorgWarner — which is a supplier to automakers like Ford Motor and Volkswagen — is expecting its net sales to fall between $14.4 billion and $14.9 billion this year, below Wall Street’s $15.31 billion consensus predicted. It is also expecting adjusted share profits between $3.65 and $4.00, below the $4.27 profit analysts have penciled in. Even so, Sekera remains optimistic, adding that “BorgWarner is well positioned to be able to supply to manufacturers irrespective of who ends up being the market share leaders at the end of the day,” as electric vehicles become a greater and greater percentage of auto production. Over the last 12 months, shares of BorgWarner are down 26.3%. Of the 19 analysts covering the stock, 11 give it a buy or overweight rating at an average price of $40, according to FactSet data. This gives it around 23.8% upside potential. Promise in lithium producers Aside from parts suppliers, Sekera sees promise in another corner of the ecosystem: lithium producers. “There was a bubble in lithium prices in 2021 — that bubble popped, and it’s been on a 12 to 18 month steady decline. We think lithium prices are probably bottoming out here,” he told CNBC Pro on Feb. 2. With estimates from the International Energy Agency indicating that over 60% of the cars sold globally would be electrified, he believes that the demand for lithium will go up substantially over the next few years, since it is a key component of electric vehicles. “When we model out how much lithium we think will be required globally to make batteries for all those electric vehicles and we compare that to how much lithium is in production today and how much additional lithium production will be needed – our team believes that lithium is going to be under-supplied by 2030,” Sekera explained. “The excess demand and without the supply, to satisfy that demand, we do think that lithium prices will stay, much higher than the marginal cost of production over the course of the next decade,” he added naming Albemarle as a company on his radar. Calling it “one of the more high quality lithium companies today,” Sekera likes the five-star rated stock as it is trading under half of Morningstar’s fair value right now. Albemarle made the news recently after laying off over 300 employees as part of previously announced cost cutting measures. While the company did not specify the number of jobs affected, Reuters reported that the move would save it at least $50 million just this year. Shares of the U.S. lithium company have had a bumpy ride over the past days. Over the last 12 months, shares of Albemarle are down 55.5%. Of the 30 analysts covering the stock, 19 give it a buy or overweight rating at an average price of $156.16, according to FactSet data. This gives it around 30% upside potential."}
{"title": "Tesla Price Yo-Yo Continues With Model Y Hikes In Europe - Investor's Business Daily", "description": "Tesla Price Yo-Yo Continues With Model Y Hikes In Europe  Investor's Business Daily", "published date": "Tue, 13 Feb 2024 21:23:00 GMT", "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmludmVzdG9ycy5jb20vbmV3cy90ZXNsYS1wcmljZS15by15by1jb250aW51ZXMtd2l0aC1tb2RlbC15LWhpa2VkLWluLWV1cm9wZS_SAQA?oc=5&hl=en-GB&gl=GB&ceid=GB:en", "publisher": {"href": "https://www.investors.com", "title": "Investor's Business Daily"}, "content": "Tesla (TSLA) raised Model Y prices in some European countries overnight, less than a month after cutting European prices on its top-selling EV and days after temporarily reducing U.S. prices. Tesla stock fell modestly early Tuesday.\n\nX\n\nThe U.S. EV giant hiked its Standard Range+ Model Y in Germany by 2,000 euros to 44,990 euros. It raised its Long Range and Performance variants by 2,500 euros, to 52,490 euros and 58,490 euros, respectively. That's after cutting the Model Y SR+ by 1,900 euros on Jan. 17, while reducing the other two variants by 5,000 euros.\n\nTesla also raised Model Y prices in Norway by 3.9%-5.3%, after reducing them by 5.6%-7.1% on Jan. 17. Prices are still slightly lower than they were before the Jan. 17 cut.\n\nOn Feb. 12, Tesla's Berlin plant restarted production after a two-week suspension. The company cited parts shortages due to Red Sea shipping delays, but there was no question that Model Y inventories were high.\n\nWhile Tesla prices have trended sharply lower since the start of 2023, the EV maker has raised prices at times.\n\nOn Saturday, Tesla reduced U.S. prices on its Real Wheel Drive and All Wheel Drive Model Y variants by $1,000, but only through Feb. 29. Tesla still discounts Model Y inventory by far more than current list prices.\n\nA week earlier, Tesla raised the Model 3 Long Range price in the U.S. by $1,000.\n\nTesla Stock\n\nTSLA stock sank 2.2% to 184.02 Tuesday. Shares fell 2.8% on Monday.\n\nPlease follow Ed Carson on Threads at @edcarson1971 and X/Twitter at @IBD_ECarson for stock market updates and more.\n\nYOU MIGHT ALSO LIKE:\n\nWhy This IBD Tool Simplifies The Search For Top Stocks\n\nWant To Get Quick Profits And Avoid Big Losses? Try SwingTrader\n\nBest Growth Stocks To Buy And Watch\n\nIBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today\n\nTesla, BYD Struggle Amid Weak Earnings, Tough Climate\n\nMarket Rally Tested; Lyft Soars Late"}
{"title": "Tesla Stock Forecast: Bullish. But Not For the Reason You Think - Investment U", "description": "Tesla Stock Forecast: Bullish. But Not For the Reason You Think  Investment U", "published date": "Tue, 13 Feb 2024 20:40:03 GMT", "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vaW52ZXN0bWVudHUuY29tL3Rlc2xhLXN0b2NrLWZvcmVjYXN0LTIv0gEA?oc=5&hl=en-GB&gl=GB&ceid=GB:en", "publisher": {"href": "https://investmentu.com", "title": "Investment U"}, "content": "Tesla (TSLA) is one of the most fascinating companies in the world. This is mainly due to its dual status as both a revolutionary technology company and a meme stock. On one hand, Tesla is pioneering so many new technologies and is legitimately one of the best 6 non-FAANG stocks to hold for the next decade. But, on the other hand, you have Elon Musk selling short-shorts for $69.420 to mock investors who doubt the company. It just seems like a true banana republic over there at Tesla HQ.\n\nTesla’s stock was one of the biggest winners during 2020 and 2021, rising a staggering 1,000%. But, 2022 and 2023 were a bit less-than-stellar with Tesla losing roughly 50%. Heading into 2024, investors are trying to figure out what type of Tesla stock forecast to plan for. As for me, I’m bullish on Tesla. But, probably not for the reasons that you think.\n\nDisclaimer: This article is for general informational and educational purposes only. It should not be construed as financial advice as the author, Ted Stavetski, is not a financial advisor.\n\nTesla (TSLA) Stock Forecast\n\nTesla has been on a tear over the past few years, reaching profitability much faster than many investors were expecting. But, the past few quarters haven’t been as rosy. Here’s how Tesla performed over the last three quarters:\n\nSeptember 2023\n\nRevenue: $23.35 billion (+8% YoY) Net Income: $1.85 billion (-43% YoY)\n\n\n\nJune 2023\n\nRevenue: $24.93 billion (+47% YoY) Net Income: $2.7 billion (+20% YoY)\n\n\n\nMarch 2023\n\nRevenue: $23.33 billion (+24% YoY) Net Income: $2.51 billion (-24% YoY)\n\n\n\nRevenue growth has become a bit stagnated recently, and CEO Elon Musk has even resorted to slashing prices on certain EV models to increase sales. These price cuts have been in response to increased competition from legacy automakers as well as Chinese EV companies. For years, Tesla enjoyed a unique position as the world’s only major electric vehicle company. But, those days are rapidly coming to an end as virtually every single automaker now produces several lines of EVs.\n\nAs far as whether or not Tesla stock is overpriced, Tesla currently has a price-to-earnings ratio of just 42. While this is significantly higher than most automakers, it really isn’t that much for a tech company. Either way, I don’t want to spend too much of this Tesla stock forecast talking about EVs because I don’t think that will be the main driver for TSLA stock moving forward.\n\nTesla’s Future isn’t EVs\n\nThe future of Tesla isn’t EVs – it’s robots.\n\nInvestors have always viewed Tesla as a technology company first and a carmaker second. After all, Teslas are essentially just computers on wheels. This mentality of investors to treat Tesla as a tech company is what has allowed the company to command such high valuations in the past.\n\nIf Tesla was “just a car company” then it wouldn’t trade at 50X earnings (and even higher in the past).\n\nRight now, Tesla is working on a new product that’s gotten a surprisingly quiet reception: the Optimus humanoid robot. If you haven’t already seen videos of Tesla’s Generation 2 Optimus then quickly watch this 2-minute-long video. It looks like a prequel to “I, Robot.” If you haven’t seen I, Robot, it’s an old Will Smith movie where humans live alongside robots.\n\nNow, most people reading this Tesla stock forecast will probably scoff and assume that this tech is at least a decade or two down the road. It isn’t. There’s a very good chance that Tesla’s humanoid business will eclipse its EV business in the few few years.\n\nMusk’s Comments\n\nThe Optimus is still a prototype. As such, it didn’t get a lot of screen time during Tesla’s last earnings call in January. But, CEO Elon Musk had this to say about Optimus:\n\n“Optimus obviously is a very new product, an extremely revolutionary product. It’s something that I think has the potential to far exceed the value of everything else that Tesla combined.”\n\nElon Musk has been known to hype up Tesla products in the past. But, this is still high praise coming from the company’s CEO.\n\nTesla’s Advantage\n\nAs far as competing in the humanoid market, one major thing that sets Tesla apart is its manufacturing capability. This will help Tesla compete (and beat) other robotics companies, like Boston Dynamics for example.\n\nTesla is already one of the biggest car manufacturers in the world and delivered 1.81 million cars in 2023. At the same time, it has AI capabilities from developing cars that can translate over to developing humanoids. In fact, Tesla actually uses the same AI inference technology for both cars and robotics (according to Musk on Tesla’s last earnings call).\n\nFinally, Tesla has the capital-raising ability to help scale the humanoid technology once it’s ready. Honestly, Musk could probably pay for it all himself if he really wanted to.\n\nMonetizing Humanoids\n\nSo, yes, Tesla might be at the forefront of the humanoid revolution. But, how will this turn into profit for EV manufacturers? Well, humanoids are clearly an emerging technology which means that there isn’t a set use case just yet. But, the possibilities are nearly limitless. Tesla designed Optimus to fit smoothly into human society. With this in mind, you could theoretically swap in an Optimus into whatever tasks a human could do. Here are a few examples:\n\nLicensing humanoids to manufacturing companies for use in factories\n\nSelling or renting them to consumers for use in the home\n\nUsing humanoids for manual, repetitive tasks (yes, this likely means replacing human workers at places like fast food restaurants or delivery companies).\n\nAs far as the timeline for when humanoids will be released, it’s tough to say. But, I have a feeling that it will be much closer than investors think, considering where the tech is at now and how fast AI is accelerating. Additionally, it doesn’t necessarily matter when Tesla starts profiting from these robots. All that matters is the hype cycle that leads up to the robots. Once the hype starts to build, investors will start to pull projected earnings forward.\n\nThe Elephant in the Room\n\nOne concern for Tesla shareholders is the company’s erratic CEO: Elon Musk. Five years ago, having Musk at the helm was an undeniable tailwind for the company. In the past, Musk’s behavior was likened to that of a “crazy genius” like Tony Stark. But, Musk’s behavior has felt a bit more “crazy” than “genius” lately. When writing any Tesla stock forecast, Musk is definitely a risk factor worth mentioning.\n\nHere’s a quick history of Elon Musk’s questionable decision-making over the past few years:\n\nSo, what happens if Musk starts acting similarly at Tesla? If the board refuses to give him more shares, will he hold a press conference and tell the board to go f*ck themselves? Will he lay off any engineer who disagrees with him? Will he crash the value of Tesla by 70% with shoddy decision-making? These questions sound absurd. But, he’s done all of these things with Twitter – so why not Tesla?\n\nThere’s also the fact that Elon Musk currently runs six different companies: Tesla, SpaceX, xAI, The Boring Company, Neuralink, and X (Twitter). No person can realistically work six different jobs, which calls into question his capabilities as a CEO.\n\nFor years, Elon Musk was Tesla’s biggest asset. But, he might be turning into its biggest liability. If Tesla can leverage the “genius” side of Elon Musk and mitigate the “crazy” then the future looks bright for this growing humanoid company.\n\nI hope that you’ve found this Tesla stock forecast valuable in learning whether or not Nvidia is overvalued. If you’re interested in reading similar articles, be sure to subscribe below to get alerted of new articles from InvestmentU."}
{"title": "'Stay Long and Strong,' Says Daniel Ives About Tesla Stock - TipRanks.com - TipRanks", "description": "'Stay Long and Strong,' Says Daniel Ives About Tesla Stock - TipRanks.com  TipRanks", "published date": "Tue, 13 Feb 2024 17:53:29 GMT", "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LnRpcHJhbmtzLmNvbS9uZXdzL3N0YXktbG9uZy1hbmQtc3Ryb25nLXNheXMtZGFuaWVsLWl2ZXMtYWJvdXQtdGVzbGEtc3RvY2vSAQA?oc=5&hl=en-GB&gl=GB&ceid=GB:en", "publisher": {"href": "https://www.tipranks.com", "title": "TipRanks"}, "content": "The bears are in the Tesla (NASDAQ:TSLA) house. It has been almost exclusively bad news for the EV leader recently. There was a car crash of sorts in its Q4 earnings release and that was followed by a negative ruling for CEO Musk in a lawsuit filed by a shareholder regarding his pay package set by the board in 2018. Meanwhile, demand for EVs has stalled with many concerned the Tesla growth story has hit a brick wall.\n\nHowever, one long-standing Tesla bull is having none of it. Wedbush’s Daniel Ives, a 5-star analyst rated in the top 3% of the Street’s stock pros, acknowledges the current wave of negativity surrounding Tesla as perhaps the most severe in recent memory. However, he stands firm in his conviction, resolutely refusing to join the ranks of the naysayers.\n\n“We could not disagree more with the ultra negative Tesla narrative building and forming a black cloud over the stock,” the 5-star analyst went on to say. “While the next few months are clearly a bit cloudy for the Tesla story and overall EV demand, longer term our view is that by the end of the decade ~20% of autos will be EV with autonomous and FSD a reality and not a dream/aspiration.”\n\nConsidering the stock’s recent poor performance (down 26% year-to-date), Ives believes the stock is “baking in a tremendous amount of bad news here.”\n\nThat said, it is now up to the Board to outline a strategy investors can get behind, with Musk front and center of it. In Ives’ view, the Tesla Board must undertake three actions to “stop this Category 5 hurricane over Tesla’s stock.”\n\nFor one, it needs to introduce a fresh compensation package to replace the 2018 one, alongside a “new package post proxy” to be voted upon at the upcoming shareholder meeting in May. Secondly, the new compensation package should aim to achieve Musk’s targeted 25% voting share. Lastly, Ives supports the idea of Tesla relocating its legal base to Texas, which he believes would facilitate granting Musk the 25% voting rights and the implementation of a revised compensation plan. Moving to Texas, says the analyst, will “take out the uncertainty of Musk and his AI initiatives going anywhere else except under the Tesla hood with a key 3-5 years ahead for the Tesla story.”\n\nAll in, Ives maintained an Outperform (i.e., Buy) rating on Tesla shares, to go along with a $315 price target, implying the stock will climb 71% higher over the one-year timeframe. (To watch Ives’ track record, click here)\n\nIves is certainly among the Street’s bull contingent but not all are quite as confident. The stock gets a Hold consensus rating, based on a mix of 12 Buys, 17 Holds and 5 Sells. Going by the $220.26 average target, a year from now, the shares will be changing hands for a 20% premium. (See Tesla stock forecast)\n\nTo find good ideas for stocks trading at attractive valuations, visit TipRanks’ Best Stocks to Buy, a tool that unites all of TipRanks’ equity insights.\n\nDisclaimer: The opinions expressed in this article are solely those of the featured analysts. The content is intended to be used for informational purposes only. It is very important to do your own analysis before making any investment."}
{"title": "Will Nvidia Keep Going Up in 2024 as Stock Split Chatter Grows? - TradingView", "description": "Will Nvidia Keep Going Up in 2024 as Stock Split Chatter Grows?  TradingView", "published date": "Tue, 13 Feb 2024 17:38:53 GMT", "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LnRyYWRpbmd2aWV3LmNvbS9uZXdzL2JhcmNoYXJ0OmFjZTkzYzkxNTA5NGI6MC13aWxsLW52aWRpYS1rZWVwLWdvaW5nLXVwLWluLTIwMjQtYXMtc3RvY2stc3BsaXQtY2hhdHRlci1ncm93cy_SAQA?oc=5&hl=en-GB&gl=GB&ceid=GB:en", "publisher": {"href": "https://www.tradingview.com", "title": "TradingView"}, "content": "Nvidia NVDA stock hit yet another record high yesterday, and its market cap briefly surpassed that of Amazon AMZN in the process. We are only about midway into February, and Nvidia shares have already soared 46% year-to-date - making it the best-performing stock on the S&P 500 Index SPX so far in 2024.\n\nFor Nvidia, the rally seems to have taken off from where it left off last year. With gains of 240%, it was the best-performing S&P 500 stock in 2023, also. Last year, the company became the first chip designer to command a market cap of $1 trillion, and has now hit the milestone of $1.5 trillion in 2024. Now, not even a $2 trillion market cap looks out of bounds for NVDA, looking at the market sentiments.\n\nAt the same time, a section of the market – which includes valuation guru Ashwath Damodaran – believes that the rise in Nvidia stock has gone too far. Can Nvidia stock continue to rise in 2024, and will the company consider a stock split after its breathtaking rally? We’ll explore in this article.\n\nWill Nvidia Stock Keep Going Up in 2024?\n\nLooking at Nvidia’s consensus target price of $675.52, it seems that Wall Street does not expect the stock to rise any higher. However, the Street-high target price of $1,100 implies that the stock has still room to keep running. Barchart\n\nNotably, brokerages have gradually raised Nvidia’s target price over the last year following the company’s earnings releases – which, to put it simply, have been stellar. Nvidia is set to report earnings again later this month, and we might see analysts raise their target prices yet again.\n\nIt is not uncommon for shares to trade above their target prices, with Tesla TSLA being a prime example. The Elon Musk-run company has traded above its consensus target price often, especially when the stock sees upward momentum.\n\nIs Nvidia Stock Starting to Get Overvalued?\n\nWhile Nvidia has been an undeniable beneficiary of rising investment interest in the artificial intelligence (AI) space, a section of the market is now getting apprehensive about the company’s valuation. On one level, we have those who seem to believe that the AI euphoria will eventually bust – and so will Nvidia’s soaring revenues from selling AI chips.\n\nThen we have those who believe that soon enough Nvidia won’t have the kind of “home run” advantage that it has enjoyed over the last year, as competitors also come up with chips to match that of Nvidia.\n\nDamodaran Believes Nvidia is Quite Overvalued\n\nAswath Damodaran believes that the entire “Magnificent 7” pack is overpriced, while stressing that “Nvidia stands out as particularly overpriced.” Incidentally, Damodaran prefers Apple AAPL and Tesla out of the group. However, on Apple, analysts don’t seem to agree with the New York University finance professor; three brokerages downgraded the stock last month, which is quite a rarity for the iPhone maker.\n\nFor those who have been following Damodaran for a while, his finding Tesla stock attractive might come as a surprise. In the past, his valuation for Tesla stock used to be way below the stock’s then-target price.\n\nDamodaran said that he plans to sell some Nvidia shares, while adding that he halved his holdings last year, as well. In his tweet, the “dean of valuation” said, “there is no point having an investment philosophy, if you don't act on it.”\n\nTo be sure, the kind of valuations that Nvidia now trades at would not make the stock a fit for value investors like Damodaran. However, for those chasing growth, I believe Nvidia is a long-term buy-and-hold story. While the stock could (and ideally should) correct from these levels, the long-term growth story remains intact.\n\nShould Nvidia Split Its Stock in 2024?\n\nEven as analysts and valuation gurus debate over how much Nvidia is actually worth, several retail investors are now speculating on an NVDA stock split. For context, when Nvidia announced its most recent stock split in July 2021, its stock price was in the ballpark of $750 – similar to its intraday highs yesterday. Barchart\n\nAfter the mammoth tech sector rally of 2023 – which has extended into 2024, as well – some investors are calling for top performers like Nvidia and Meta Platforms META to split their shares. Notably, while Nvidia has split its shares on five occasions since its 1999 listing, Meta hasn’t ever split its shares since listing as a public company back in May 2012.\n\nTo be sure, a stock split does not have any impact on a stock’s fundamentals, apart from aiding positive sentiments and an expected increase in trading volumes. That said, markets perceive a stock split as a positive, and usually, we'll see a stock go higher following the announcement of a stock split.\n\nOverall, I believe as Nvidia stock continues to scale new highs, the board will eventually consider a stock split - which could only add to the euphoria among retail traders.\n\nOn the date of publication, Mohit Oberoi had a position in: NVDA , META , AMZN , AAPL . All information and data in this article is solely for informational purposes. For more information please view the Barchart Disclosure Policy here."}
{"title": "Tesla Stock is Dead, Long Live Tesla? - Schaeffers Research", "description": "Tesla Stock is Dead, Long Live Tesla?  Schaeffers Research", "published date": "Tue, 13 Feb 2024 17:22:33 GMT", "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LnNjaGFlZmZlcnNyZXNlYXJjaC5jb20vY29udGVudC9iZ3MvMjAyNC8wMi8xMy90ZXNsYS1zdG9jay1pcy1kZWFkLWxvbmctbGl2ZS10ZXNsYdIBAA?oc=5&hl=en-GB&gl=GB&ceid=GB:en", "publisher": {"href": "https://www.schaeffersresearch.com", "title": "Schaeffers Research"}, "content": "Subscribers to Chart of the Week received this commentary on Sunday, February 11.\n\nWhile it takes very little for Elon Musk’s Tesla Inc (NASDAQ:TSLA) to stay in headlines, this past week saw an interesting take from online business publisher Institutional Investor. In a Feb. 6 post titled, \"Tesla Short Sellers Are in the Black This Year\" author Michelle Celarier described the electric vehicle (EV) maker’s lackluster performance on the charts in the past 12+ months with the caveat that short sellers have experienced resounding success so far in 2024.\n\nShe cites one hedge fund manager saw a more than 5% net return in January, with over half coming from its TSLA short position. Another hedge fund sported a nearly 16% pop in the same time frame.\n\nThe victory lap taken by these short sellers requires some nuance and context. While many have viewed Tesla stock as this unassailable juggernaut, there have been signs of weakness –that are highlighted in the article -- wrought by Musk’s less-than-ideal damage to the company’s brand (and its subsequent worth). And while these current shorts can pat themselves on their back, for more perspective, the current number of short interest (80 million) is below its level at this time last year and 90% below its 2018 peak. In simpler terms, the number of shorts benefitting from this movement is lower than claimed.\n\nA now former member of the omnipotent \"Magnificent 7,\" which includes peers Apple (AAPL), Microsoft (MSFT), Alphabet (GOOGL), Amazon.com (AMZN), Nvidia (NVDA), and Meta Platforms (META), Tesla stock has shed 20% in the past six months alone, a large chunk coming from a 12.1% drawdown on Jan. 25 in the wake of the company’s disappointing fourth-quarter report. Amid the subsequent consolidation pattern, the formerly supportive 20-day moving average now looms above, leaving another layer of resistance on the table for Tesla stock traders.\n\nIt’s worth noting is that the security’s $600 billion market cap is roughly half of what it was at its peak in November 2021 -- $1.2 trillion. Per Schaeffer’s Senior Market Analyst Chris Prybal, TSLA’s Price to Revenue or price/sales (P/S) at that time peaked out at 26.0, so TSLA was valued at 26x Sales. With TSLA now at $600B, it’s now trading at a P/S ratio of 6.0. While this is a significant discount to peak valuation, it contrasts with other automakers. Peers of Tesla stock currently sport a P/S ratio of: Ferrari (RACE) 11.0, Rivian Automotive (RIVN) 4.0, Toyota Motor (TM) 1.0, Honda Motor (HMC) Stellantis (STLA) 0.40, Ford Motor (F) 0.30, and General Motors (GM) 0.25.\n\nAs shown in the chart below provided by Schaeffer’s Senior Quantitative Analyst Rocky White, there has been a \"shifting of gears\" taking place in the last five years among the auto sector. Tesla stock (dark blue line) saw an extreme correction following its late-2020 valuation peak, and is now sitting at P/S levels only touched briefly in 2022-2023 and the first half of 2020. The recent (and long-term) performance of short selling Tesla stock combined with our P/S evaluation, could indicating that should past be precedent, we could be looking down the barrel of a massive course correction for the EV stock’s valuation."}
{"title": "Here's Why Cathie Wood Can't Stop Buying This Artificial Intelligence (AI) Stock - The Motley Fool", "description": "Here's Why Cathie Wood Can't Stop Buying This Artificial Intelligence (AI) Stock  The Motley Fool", "published date": "Tue, 13 Feb 2024 16:45:00 GMT", "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAyLzEzL2hlcmVzLXdoeS1jYXRoaWUtd29vZC1jYW50LXN0b3AtYnV5aW5nLXRoaXMtYXJ0aWZpL9IBAA?oc=5&hl=en-GB&gl=GB&ceid=GB:en", "publisher": {"href": "https://www.fool.com", "title": "The Motley Fool"}, "content": "The day after a lackluster fourth-quarter and full-year 2023 earnings report, Tesla (TSLA -2.19%) shares slid 12% on Jan. 25, and currently remain more than 50% off of highs. With macroeconomic headwinds forming and limited growth in the electric vehicle industry expected in the near term, Tesla investors are having to readjust expectations for the first time in a while.\n\nBut not popular investor Cathie Wood. Treating the sell-off as a buying opportunity, the funds of the Ark Invest CEO scooped up around 377,000 shares, good enough to bring Ark's total position up to a value of $796 million and around 6% of its entire portfolio.\n\nArrows-Out Expand NASDAQ: TSLA Tesla Today's Change (-2.19%) -US$4.11 Current Price US$184.02 Arrow-Thin-Down YTD 1w 1m 3m 6m 1y -14.11% 5y Price VS S&P TSLA Key Data Points Market Cap $586B Day's Range US$182.11 - US$187.26 52wk Range US$152.37 - US$299.29 Volume 86,759,478 Avg Vol 114,341,199 Gross Margin 18.25% Dividend Yield N/A\n\n\n\nWhile Tesla's success in the electric vehicle industry aligns perfectly with Ark Invest's strategy of investing in disruptive and innovative companies, it probably isn't why Wood went on the recent buying spree. The real reason boils down to one thing: artificial intelligence (AI).\n\nAs Wood plainly put it in a November 2023 interview on CNBC, Tesla is the \"biggest AI play\" on the market today. But what does that really mean? With a deeper exploration, it becomes abundantly clear why Wood and other AI enthusiasts are so bullish on Tesla, CEO Elon Musk, and the company's various AI frontiers.\n\nThe taxis that drive themselves\n\nWood's enthusiasm regarding Tesla's AI future is primarily related to autonomous driving. Even though the technology has yet to completely replace drivers, Tesla achieved a major breakthrough in 2023. Previously, Tesla software engineers would code in responses for vehicles to make, but now the vehicle's course of action is determined by artificial intelligence neural networks that learn to drive just like you and me. The breakthrough holds the potential to scale development of the full-self driving software much faster and efficiently since humans are no longer needed to hardcode individual responses.\n\nMotley Fool Returns Market-beating stocks from our flagship service. Stock Advisor Returns 620% S&P 500 Returns 147% Calculated by average return of all stock recommendations since inception of the Stock Advisor service in February of 2002. Returns as of . Discounted offers are only available to new members. Stock Advisor list price is $199 per year. Join Stock Advisor Cumulative Growth of a $10,000 Investment in Stock Advisor Calculated by Time-Weighted Return since 2002. Volatility profiles based on trailing-three-year calculations of the standard deviation of service investment returns.\n\nOnce full autonomy is reached, a reality Musk sees happening by late 2025, Musk aims to launch a robotaxi business where users can hail rides from self-driving vehicles. Citing what he has called \"quasi-infinite\" demand, Musk believes the successful launch of a robotaxi fleet will be a moment talked about 100 years from now. While at times eccentric in his thinking, Musk isn't alone in the belief that robotaxis could transform society and spur financial growth for the company.\n\nConducting a Monte Carlo simulation that used computer algorithms to predict a range of potential outcomes based on mix of possible variables, analysts from Ark Invest attempted to quantify the impact a robotaxi business could have on Tesla's bottom line. Based on the results, Ark Invest projected in April 2023 that robotaxis could eventually account for 44% of total revenue and help push the company past the $1 trillion revenue mark, nearly a 4,000% increase from today. Should that estimate become reality, Tesla could reach $2,000 per share, a far cry from current prices of around $190.\n\nThese numbers may sound astronomical, but that doesn't mean they should be dismissed. One of the primary reasons Wood and her team think robotaxis could generate significant revenue lies in the assumption that a robotaxi business would operate similarly to software-as-a-service (SaaS) products.\n\nLike SaaS business models, Tesla's primary expense with a robotaxi fleet would be maintenance and upkeep of the software. With a lack of expenses related to hardware or materials, Tesla's robotaxis could achieve SaaS-like margins of greater than 75%.\n\nBuilding the robot of the future\n\nWhile Wood thinks that robotaxis hold the most potential for Tesla in the near to mid term, she hasn't yet ruled out the long-term potential that its humanoid robot, Optimus, could bring in the future.\n\nOptimus is primarily designed to take over hazardous or repetitive tasks that are currently performed by humans and holds the potential to disrupt labor markets across several industries. With plans to implement the robot in Tesla factories and test its capabilities on the EV assembly line, Musk expects that with continued refinement, Optimus will be available for purchase by customers in 2025.\n\nAs with autonomous driving technology, there is still room for improvement, but advancements are progressing. In October 2023, Tesla unveiled the newly revamped second generation of Optimus, which moves 30% faster, boasts more fluid body control, has tactile sensing on all fingers, and weighs 20 pounds less.\n\nWith the humanoid robotic market projected to grow from $1.8 billion to more than $13.8 billion by 2028, the successful development of Optimus could expose Tesla to another lucrative source of revenue. Should the current trajectory be maintained, Musk has said he foresees a day when Optimus accounts for the \"majority of Tesla's long-term value.\"\n\nTesla's secret weapon\n\nWood's optimism for Tesla's AI future goes deeper than just the results of a Monte Carlo simulation or Musk's wishful thinking. Unlike other companies developing AI business models, Tesla has a secret weapon that gives it an advantage: its supercomputer Dojo.\n\nDeveloped in-house by Tesla engineers, Dojo provides the computing power to process millions of hours of driving data from its vehicles around the world. Designed specifically for AI applications, Dojo is then used to train visual AI models used in self-driving software.\n\nSince its official revealing in August 2021, Dojo's capabilities have only increased with time, a trend that will likely continue. Musk intends to make Dojo the most powerful supercomputer in the world by Q4 2024, with plans to invest more than $1 billion into its development in the next year.\n\nRecognizing Dojo's importance and growing capabilities, Wood believes that the supercomputer \"will increase the odds that Tesla will be the first to roll out a nationwide autonomous taxi platform.\" Only time will tell, but on its current trajectory, and given Musk's track record of following through on goals (even if deadlines are overly ambitious), the stars are aligning for Tesla to become the global leader in AI."}
{"title": "Tesla board silent as investors await next steps after court revokes Elon Musk's $56 billion pay package - CNBC", "description": "Tesla board silent as investors await next steps after court revokes Elon Musk's $56 billion pay package  CNBC", "published date": "Tue, 13 Feb 2024 13:30:01 GMT", "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDIvMTMvdGVzbGFzLWJvYXJkLXNpbGVudC1zaW5jZS1lbG9uLW11c2tzLTU2LWJpbGxpb24tcGF5LXBhY2thZ2UtcmV2b2tlZC5odG1s0gFsaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjQvMDIvMTMvdGVzbGFzLWJvYXJkLXNpbGVudC1zaW5jZS1lbG9uLW11c2tzLTU2LWJpbGxpb24tcGF5LXBhY2thZ2UtcmV2b2tlZC5odG1s?oc=5&hl=en-GB&gl=GB&ceid=GB:en", "publisher": {"href": "https://www.cnbc.com", "title": "CNBC"}, "content": "In this article TSLA -0.02 (-0.01%) Follow your favorite stocks CREATE FREE ACCOUNT\n\nElon Musk, CEO of Tesla and X, speaks at the Atreju political convention organized by Fratelli d’Italia (Brothers of Italy), in Rome, Dec. 15, 2023. Antonio Masiello | Getty Images\n\nTwo weeks after a Delaware court ruled that Tesla must rescind Elon Musk’s $56 billion pay package, the company’s board remains mum on what the decision means for shareholders or what’s next for the mercurial CEO. In her 200-page opinion on Jan. 30, Chancellor Kathaleen McCormick called the pay plan the largest in public corporate history, and said it was agreed upon by people “who were beholden to Musk.” Since then, Musk has lashed out at the court, posted “Never incorporate your company in the state of Delaware” on his social media platform X, and said Tesla would hold a shareholder vote to move its site of incorporation to Texas. Tesla hasn’t yet issued an SEC filing to notify shareholders of the ruling. The decision came shortly after Musk indicated that he’s pushing for even more control of Tesla, posting on X in mid-January that he wanted roughly 25% voting control before turning the company into a leader in artificial intelligence and robotics. Musk is already building an AI company called xAI outside of Tesla. The next step in the compensation case is an “implementing order” that will be hashed out between the court, Musk’s team and the lawyers representing shareholder Richard Tornetta, a former heavy metal drummer who was the plaintiff in the 2018 lawsuit filed on behalf of all Tesla investors. As shareholders await answers, Tesla’s eight-person board, which includes Musk, his brother Kimbal, Chairwoman Robyn Denholm and former Tesla technology chief JB Straubel, has stayed silent, avoiding any public comments. CNBC sent requests for additional information to Tesla investor relations, Musk and some board members. They all went unanswered.\n\nwatch now\n\nGreg Varallo, who was lead counsel for Tornetta and is head of the Delaware office of Bernstein Litowitz Berger & Grossmann, told CNBC that theoretically Musk and his legal team could still pursue a last-minute settlement. While Varallo said he has no knowledge of Musk’s plans, he said he expects Musk to appeal the decision to the Delaware state Supreme Court. “I’d give you very high odds on that,” Varallo said. Kobi Kastiel, a law professor at Tel Aviv University, also predicts that Musk will appeal the ruling. Kastiel wasn’t involved in the litigation but he co-authored a 2023 paper in the Washington University Law Review titled “Superstar CEOs and Corporate Law” that was cited in McCormick’s ruling. “Given the high stakes involved, it is likely that Tesla will appeal the decision,” Kastiel said in an email. In the absence of a successful appeal, “any new compensation arrangement with him will have to be assessed” in light of McCormick’s decision, Kastiel said.\n\n‘Bunch of options would be returned’\n\nIn the 2018 CEO compensation plan, Tesla’s board awarded Musk a dozen tranches of stock options that would finish vesting in 2022 and were based on milestones, including many focused on stock price increases. Between the beginning of 2018 and the end of 2022, Tesla shares soared almost 500% as Musk promised to turn Tesla into not just a dominant EV brand, but a robotaxi company and solar juggernaut, among other things. The S&P 500 gained 44% over that stretch, while the Nasdaq rose 52%. Eric Talley, a professor at Columbia Law School, told CNBC that, should the ruling stand, Musk will lose his options but not any shares he previously held. The move would decrease the number of shares outstanding, potentially bolstering the value of each share held by investors. “A bunch of options would be returned to Tesla’s coffers, which is hugely accretive to stock value,” said Talley, who wasn’t involved in the case. On the other hand, Talley pointed out, “Tesla has a very grumpy CEO who might want to take his ball and go home. Thus far, trading suggests those two factors have been a wash.” Tesla shares are down slightly since the Delaware court’s decision in late January. They’re down close to 25% for the year, while major indexes are up. Musk voiced a strong preference for moving his businesses out of Delaware following the court’s decision, and encouraged others to do so as well. He moved the incorporation location for his brain computer interface company, Neuralink, from Delaware to Nevada, filings revealed last week. He’s also been a big proponent of Texas in recent years, personally relocating there from California, and building massive complexes for SpaceX and Tesla in the state, which has no personal income taxes and a much lower business tax rate. Author Walter Isaacson, who published a 688-page biography on Musk last year, told CNBC’s “Squawk Box” on Monday that if the ruling doesn’t get overturned, “it’s going to hurt Delaware.” “People will say, ‘Wait, wait, you mean five years after something happens, eight years after something happens, you’ll go back and undo it?’” Isaacson said. Tulane Law School professor Ann Lipton had a different take.\n\nwatch now\n\n“It’s a very thorough opinion and the Supreme Court should give great deference to the factual findings of the trial court,” Lipton said. In terms of what shareholders should ask of Tesla’s board now, Kastiel said, “Tornetta and recent media reports on Musk have emphasized the importance of accurate and detailed disclosure of the ties between controlling shareholders and directors.” There’s a more fundamental concern at play, Kastiel said, regarding corporate governance in cases where a “superstar CEO” is running the show. “As long as the CEO is perceived as a star and the company depends on the CEO’s vision and leadership, even nominally independent directors — those without strong ties to the CEO — will have difficulty monitoring the CEO’s conduct,” he said. Kastiel also said that the decision likely makes Musk and Tesla more vulnerable to other types of lawsuits. “Plaintiffs may have a better chance of advancing their claims by potentially leveraging the Tornetta findings to argue that the majority of the Tesla board is not independent of Musk,” he said. “To mitigate this risk, Tesla will need to significantly enhance the independence of its board and nominate new independent directors who do not have strong ties to Musk.” WATCH: Elon Musk has a lot of ‘incoming missiles’ from all sides, says Isaacson\n\nwatch now"}
{"title": "Is Tesla a Millionaire Maker? - The Motley Fool", "description": "Is Tesla a Millionaire Maker?  The Motley Fool", "published date": "Tue, 13 Feb 2024 13:01:00 GMT", "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAyLzEzL2lzLXRlc2xhLWEtbWlsbGlvbmFpcmUtbWFrZXIv0gEA?oc=5&hl=en-GB&gl=GB&ceid=GB:en", "publisher": {"href": "https://www.fool.com", "title": "The Motley Fool"}, "content": "It's easy to zoom out on a price chart for a winning stock and see how it's created life-changing wealth for those who held it over the years. Take Tesla (TSLA -2.19%) for example. The stock has returned 12,000% since its initial public offering in 2010.\n\nThat's a great result, but there were bumps and bruises along the way, including the company nearly going under while ramping up Model 3 production five years ago.\n\nToday, the stock is down over 50% off its high. The company is caught between its recent success and preparing for what will drive its future growth, which CEO Elon Musk admitted in the company's fourth-quarter earnings release.\n\nSo, can Tesla stock still make millionaires out of long-term investors? It certainly can, and the company's recent stumble might be why.\n\nThe market only cares about the short term\n\nIf there's one tip all long-term investors should know, it's that the stock market, aka Wall Street, only cares about the short term. Stocks live and die by the quarter because professional money managers must perform quickly or lose clients. In the short term, Tesla's business has slowed down in recent quarters.\n\nMotley Fool Returns Market-beating stocks from our flagship service. Stock Advisor Returns 620% S&P 500 Returns 147% Calculated by average return of all stock recommendations since inception of the Stock Advisor service in February of 2002. Returns as of . Discounted offers are only available to new members. Stock Advisor list price is $199 per year. Join Stock Advisor Cumulative Growth of a $10,000 Investment in Stock Advisor Calculated by Time-Weighted Return since 2002. Volatility profiles based on trailing-three-year calculations of the standard deviation of service investment returns.\n\nNot only are consumers grappling with record levels of household debt and higher interest rates, but Tesla has aggressively cut prices on its vehicles, shrinking profit margins and free cash flow while slowing revenue growth. Is Musk wrong to cut prices? Perhaps not. Lower prices have put a dent in Tesla's competition, and considering that just a low-single-digit percentage of vehicles are electric, there's still a ton of market share to grab.\n\nTo be clear, Tesla's financials have taken a hit. It's not that the stock dropped for no reason. But has Tesla, which delivered over 1.8 million vehicles in 2023, peaked? The likely answer is no. Consumers have indicated that price and range are the biggest hurdles to going electric. Tesla is arguably the best positioned to address those fears with an extensive charging network (which competitors are signing up to use) and likely range improvement across the broader EV field as battery technology improves.\n\nLooking at Tesla's next growth wave\n\nTesla rode the Model 3 and Model Y to tremendous growth over the past five years. Tesla's next stretch of growth should come from new products that potentially entice new customers to the brand.\n\nFor example, the recently launched Cybertruck is still in its infancy of production and brings Tesla to the passenger pickup segment, the bread and butter of legacy American automotive companies. Musk also hinted at a new low-cost vehicle in development during the company's Q4 earnings call.\n\nMeanwhile, artificial intelligence (AI) remains a focal point for Tesla. Full self driving (FSD) development continues, and Tesla is working on a humanoid robot to bring to market later this decade.\n\nArrows-Out Expand NASDAQ: TSLA Tesla Today's Change (-2.19%) -US$4.11 Current Price US$184.02 Arrow-Thin-Down YTD 1w 1m 3m 6m 1y 5y +803.12% Price VS S&P TSLA Key Data Points Market Cap $586B Day's Range US$182.11 - US$187.26 52wk Range US$152.37 - US$299.29 Volume 86,759,478 Avg Vol 114,341,199 Gross Margin 18.25% Dividend Yield N/A\n\nLastly, Tesla remains heavily invested in the energy business. Its energy storage business deployed 14.7 gigawatt hours in 2023, more than double its 2022 mark. Investors have to think about Tesla over a long time frame. As Warren Buffett once said about his general investing philosophy: \"Nobody buys a farm based on whether they think it's going to rain next year. They buy it because they think it's a good investment over 10 or 20 years.\"\n\nThis mentality is afforded only to individual long-term investors, and it's an investing superpower.\n\nAdversity could benefit investors\n\nExpectations can be a powerful thing. Analysts once believed Tesla's earnings could grow at triple-digit rates, but now expect just 15% annual growth. The pessimism is weighing on shares, dragging Tesla's forward P/E lower -- despite analysts also lowering their earnings estimates:\n\nAs I said above, Tesla's profits and growth have suffered setbacks, so I understand why shares have fallen. But should investors avoid the stock because it's raining, or own it because it could be a far bigger business in 10 years? Tesla's next growth phase could bring billions of dollars of free cash flow, which would all drive investment returns.\n\nOnly time will tell how it all plays out, but writing off Tesla's long-term growth and investment potential seems pretty shortsighted."}
{"title": "Tesla (TSLA) Stock: Another Reason to Buy The Pullback - Nasdaq", "description": "Tesla (TSLA) Stock: Another Reason to Buy The Pullback  NasdaqTesla Stock Is Falling Again. The CPI Inflation Report Can Take Some Blame.  Barron'sThe Truth About Tesla Stock: Should You Buy Now?  The Motley Fool", "published date": "Tue, 13 Feb 2024 12:39:06 GMT", "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvdGVzbGEtdHNsYS1zdG9jay1hbm90aGVyLXJlYXNvbi10by1idXktdGhlLXB1bGxiYWNr0gEA?oc=5&hl=en-GB&gl=GB&ceid=GB:en", "publisher": {"href": "https://www.nasdaq.com", "title": "Nasdaq"}, "content": "At what point does Tesla (TSLA) stock become too cheap to ignore? An argument can be made that the the shares, which have fallen almost 20% over the past month, have already reached that point.\n\nSince the electric vehicle maker reported its fourth quarter earnings January 24, TSLA stock has given up as much as 17%, falling to a low of $175. While the stock has recovered since then, reaching a recent high of $194, there’s still a 37% gap from its 52-week high of $299. This includes 20% declines in six months, while the S&P 500 index is up 12.5%. As it stands, the stock is now down 22% year to date, trailing the 5.4% rise in the S&P 500 index.\n\nFor investors who are waiting for the dust to settle, there are still plenty of reasons to expect Tesla stock to march higher. The stock has gotten grossly oversold as a result of Tesla missing Q4 estimates on both earnings and revenue. While Wall Street continues to focus on the company’s pricing challenges and headwinds related to demand, this isn’t the first time that pundits have proclaimed the death of the EV transformation and called into question Tesla’s leadership capabilities in that industry.\n\nARK Invest's Cathie Wood remains bullish on the Tesla stock. \"Tesla is going through a low right now related to the cycle,\" Wood said on CNBC. \"But when autonomous taxi networks, platforms kick in, as we think they will within the next two years... then what we’re talking about with Tesla is a reacceleration in growth and a huge increase in margins,\" she added.\n\nMeanwhile, Wedbush Securities' Dan Ives, who believes the bears have it wrong, added more assurance to Tesla stock. \"We could not disagree more with the ultra negative Tesla narrative building and forming a black cloud over the stock,\" Ives wrote in a note to investors. \"While the next few months are clearly a bit cloudy for the Tesla story and overall EV demand, longer term our view is that by the end of the decade ~20% of autos will be EV with autonomous and FSD a reality and not a dream/aspiration.\"\n\nIn citing Tesla’s downbeat earnings report, Ives was unwavering in his support, maintaining his buy-equivalent “Outperform” rating with a 12-month price target of $315. From current levels, Ives price target assumes potential premiums of 66%. To be sure, there are still critical questions that Tesla must answer for investors, namely the outlook for margins after price cuts in several markets. This is where the company will need to show revenue growth in higher-margin service businesses such as its Full Self-Driving (FSD) software, which is poised to reenergize the company’s profit margins.\n\nThe company is betting heavily on FSD which will be the birth of the autonomous vehicle evolution and is designed to automate Tesla vehicles so they can operate without a driver behind the wheel. Tesla’s FSD is at Level 3 automation (conditional driving automation), which means a driver should be engaged at all time. However, once FSD can navigate autonomously, it will not only boost Tesla’s profit margins, it will be a profit center of recurring revenues for Tesla through the company’s ambition for Robotaxis.\n\nEssentially, while the market is focused on the near-term headwinds revealed in the Q4 earnings report, it was noteworthy that Tesla management spent a significant amount of time discussing high-margin services. The company’s efforts to monetize its FSD feature by licensing the FSD software to other EV makers can become a lucrative business to reenergize the stock. Essentially, Tesla’s current competitors may eventually become the company’s partners.\n\nAs such, with Tesla stock trading below where it stood both one year ago and two years ago, now is the time to bet on a rebound in the next 12 to 18 months.\n\nDiscovering Small Cap Spark in Emerging Markets Discovering Small Cap Spark in Emerging Markets Watch More\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."}
